# 1
# Задача 22
# Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. 
# n - кол-во элементов первого множества. 
# m - кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.

# 11 6
# 2 4 6 8 10 12 10 8 6 4 2
# 3 6 9 12 15 18
# 6 12

var1 = '5 4'        # количество элементов первого и второго множества
var2 = '10 20 30 40 50'  # элементы первого множества через пробел
var3 = '10 20 50'    # элементы второго множества через пробел

# set1 = {2, 4, 6, 8, 10, 12, 10, 8, 6, 4, 2}
# set2 = {3, 6, 9, 12, 15, 18}

set1 = set(var2.split())
set2 = set(var3.split())

unique_numbers = sorted(list(set1 & set2))

print(*unique_numbers)

# решение автотеста
# mol = [int(x) for x in var1.split()]
# n = mol[0]
# m = mol[1]
# set_1 = set()
# set_2 = set()
# list_1 = list()
# a = [int(x) for x in var2.split()]
# k = set(a)
# for i in k:
#    set_1.add(i)
# b = [int(x) for x in var3.split()]
# k1 = set(b)
# for i in k1:
#    set_2.add(i)
# lok = set_1 & set_2
# kool = list(lok)
# kool.sort()
# for i in kool:
#    print(i, end=' ')

