# Задача №29.
# Ваня и Петя поспорили, кто быстрее решит следующую задачу: 
# “Задана последовательность неотрицательных целых чисел. 
# Требуется определить значение наибольшего элемента последовательности, 
# которая завершается первым встретившимся нулем (число 0 не входит в последовательность)”. 
# Однако 2  друга оказались не такими смышлеными. Никто из ребят не смог до конца сделать это задание. 
# Они решили так: у кого будет меньше ошибок в коде, тот и выиграл спор. 
# За помощью товарищи обратились к Вам, студентам.

# Ваня:
# n = int(input())          
# max_number = 1000         # error 1
# while n != 0:
#    n = int(input())
#    if max_number > n:     # error 2
#        max_number = n
# print(max_number)

# Петя:
# n = int(input())
# max_number = -1           # error 1
# while n < 0:              # error 2
#    n = int(input())
#    if max_number < n:
#        n = max_number     # error 3
# print(n)                  # error 4

# Победил Ваня со счётом 4:2

n = int(input())
max_number = n
while n != 0:
   n = int(input())
   if max_number < n:
       max_number = n
print(max_number)
